chapters/report-writing.org
# -*- org-link-file-path-type: relative; -*-
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+title: Writing Reproducible Research Reports
#+date: <2023-02-13 Mon>
#+author: Britt Anderson
#+email: britt@uwaterloo.ca
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 28.2 (Org mode 9.6-pre)
#+bibliography: /home/britt/gitRepos/Intro2Computing4Psychology/chapters/i2c4p.bib
#+cite_export: csl assets/chicago-note-bibliography-16th-edition.csl



* Writing Reproducible Reports
**  Topic Goal
To introduce writing _reproducible research_ reports: reports that mix text, code, analyses, and output into a single document so that readers can see the report and the methods used to generate the analyses and are free to re-evaluate the claims by editing the source for the "viewable" document. 


#+begin_export html
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/465412304?h=e016c6e881" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/465412304">Ka : Introducing Reproducible Reports (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>Introducing the tools we will need for reproducible report generation in Emacs with Babel</p>
#+end_export

** Many Paths - One Destination
  There is no standard for the software and tools needed to write a reproducible report. What is common is not software or tooling, but rather the final product. To be a reproducible report the reader should be able to repeat the analyses reported. That requires access to the code used to generate the analyses and the data on which the analyses were done. It should include the detailed specifics about how the data was collected, but for many (though not all experiments) the collection of the data itself is not a part of the reproducible report. If you string together a writing process that accomplishes that end then you will have produced a reproducible report. The "best" tool for the job will depend on your domain, what other workers in your area are used to and find customary, and practical concerns such as the speed of development and the ease of use. 

For this topic we will be using emacs as the text editor and a pipeline that produces a pdf file as the viewable result. That pdf will be produced from a combination of code, text, and mark-up in a single "org" file. We will use the ability of emacs and its org babel system to execute code and insert the results into our document. 

The production of a reproducible research report is inspired by ideas from [[https://en.wikipedia.org/wiki/Literate_programming][literate programming.]] One can _tangle_ the original file into only its code components. One _weaves_ the text and code into the documentation.

Other tools that are used to accomplish similar results are RStudio and related tools. One can even write a technical [[https://bookdown.org/][book]] using this pipeline. 

[[https://jupyter.org/][Jupyter notebooks]] also allow for a combination of code, text and graphics.

To compare them for their ease of use and fit to your use case will require trying them all, eventually. For now we will focus on one particular method. 

#+begin_export html
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/465412227?h=b57745ad88" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/465412227">Kb : What are Reproducible Research Reports (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>What is a reproducible research report. What tools do you need and how does it relate to literate programming?</p>
#+end_export


** Preliminaries

*** Latex Installing


[[https://en.wikipedia.org/wiki/LaTeX][LaTex]] is a type setting program. It is widely used in the mathematical and computing communities for its ability to produce precisely and correctly typeset mathematical notation. But it has grown well beyond those roots. We will use it as the method to go from a plain .tex file to a .pdf file. 

#+begin_export html
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/465412148?h=edf6c82157" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/465412148">Kc : LaTeX tools for report generation (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>Getting the latex packages you will need from Ubuntu for these exercises. What is LaTeX?</p>
#+end_export


Our emacs editor will be able to export our org file into a tex file. To go the rest of the way to a pdf we will need various libraries and packages available through our Linux installation.  Since these will be used by emacs, but not part of emacs, we will use the system package manager to get and install them. It is quite possible to use latex and all the related tools from the command line and it can often be helpful to do so. It is also possible to use these libraries from other editors. Thus we will install them with =apt=, a package manager for *buntus.

#+BEGIN_SRC sh :eval never
sudo apt install texlive-latex-recommended
sudo apt install texlive-latex-extra
#+END_SRC

There is also a "full" package as well that you can install instead of the above. 

LaTeX could be a whole lecture (maybe even a course) in itself. We will not go into that here, but we will just use it behind the scenes. If you are interested though there are some nice tutorials. 

   
