book/report-writing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-05-29 Mon 11:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Writing Reproducible Research Reports</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Writing Reproducible Research Reports</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org76318aa">1. Writing Reproducible Reports</a>
<ul>
<li><a href="#orgea77fd4">1.1. Topic Goal</a></li>
<li><a href="#orga55a639">1.2. Many Paths - One Destination</a></li>
<li><a href="#org26f3e84">1.3. Preliminaries</a>
<ul>
<li><a href="#org2ff8df6">1.3.1. Latex Installing</a></li>
<li><a href="#org410ecef">1.3.2. LaTeX Tutorials for Beginners</a></li>
<li><a href="#orgc922f0a">1.3.3. Pdf Viewers</a></li>
<li><a href="#org9360cae">1.3.4. Preparing Xubuntu</a></li>
<li><a href="#orgba20488">1.3.5. Preparing Emacs</a></li>
<li><a href="#orga9625eb">1.3.6. Building Pdf-Tools</a></li>
</ul>
</li>
<li><a href="#org5561e4c">1.4. Writing a simple report</a></li>
<li><a href="#org2552348">1.5. Writing a not-so-simple report</a>
<ul>
<li><a href="#org4c430ec">1.5.1. Testing the inclusion of source code</a></li>
<li><a href="#orgd652728">1.5.2. Tables.</a></li>
<li><a href="#orgd839dde">1.5.3. What is an inline result?</a></li>
<li><a href="#orgb2f80b6">1.5.4. Can I include references?</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org41e4699">2. Assessment: Report Generation with Org Babel</a>
<ul>
<li><a href="#org08f7625">2.1. Purpose</a></li>
<li><a href="#orgc837c39">2.2. Task</a></li>
<li><a href="#org0a197e4">2.3. Comments</a></li>
</ul>
</li>
</ul>
</div>
</div>



<div id="outline-container-org76318aa" class="outline-2">
<h2 id="org76318aa"><span class="section-number-2">1.</span> Writing Reproducible Reports</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgea77fd4" class="outline-3">
<h3 id="orgea77fd4"><span class="section-number-3">1.1.</span> Topic Goal</h3>
<div class="outline-text-3" id="text-1-1">
<p>
To introduce writing <span class="underline">reproducible research</span> reports: reports that mix text, code, analyses, and output into a single document so that readers can see the report and the methods used to generate the analyses and are free to re-evaluate the claims by editing the source for the "viewable" document. 
</p>


<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/465412304?h=e016c6e881" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/465412304">Ka : Introducing Reproducible Reports (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>Introducing the tools we will need for reproducible report generation in Emacs with Babel</p>
</div>
</div>

<div id="outline-container-orga55a639" class="outline-3">
<h3 id="orga55a639"><span class="section-number-3">1.2.</span> Many Paths - One Destination</h3>
<div class="outline-text-3" id="text-1-2">
<p>
There is no standard for the software and tools needed to write a reproducible report. What is common is not software or tooling, but rather the final product. To be a reproducible report the reader should be able to repeat the analyses reported. That requires access to the code used to generate the analyses and the data on which the analyses were done. It should include the detailed specifics about how the data was collected, but for many (though not all experiments) the collection of the data itself is not a part of the reproducible report. If you string together a writing process that accomplishes that end then you will have produced a reproducible report. The "best" tool for the job will depend on your domain, what other workers in your area are used to and find customary, and practical concerns such as the speed of development and the ease of use. 
</p>

<p>
For this topic we will be using emacs as the text editor and a pipeline that produces a pdf file as the viewable result. That pdf will be produced from a combination of code, text, and mark-up in a single "org" file. We will use the ability of emacs and its org babel system to execute code and insert the results into our document. 
</p>

<p>
The production of a reproducible research report is inspired by ideas from <a href="https://en.wikipedia.org/wiki/Literate_programming">literate programming.</a> One can <span class="underline">tangle</span> the original file into only its code components. One <span class="underline">weaves</span> the text and code into the documentation.
</p>

<p>
Other tools that are used to accomplish similar results are RStudio and related tools. One can even write a technical <a href="https://bookdown.org/">book</a> using this pipeline. 
</p>

<p>
<a href="https://jupyter.org/">Jupyter notebooks</a> also allow for a combination of code, text and graphics.
</p>

<p>
To compare them for their ease of use and fit to your use case will require trying them all, eventually. For now we will focus on one particular method. 
</p>

<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/465412227?h=b57745ad88" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/465412227">Kb : What are Reproducible Research Reports (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>What is a reproducible research report. What tools do you need and how does it relate to literate programming?</p>
</div>
</div>


<div id="outline-container-org26f3e84" class="outline-3">
<h3 id="org26f3e84"><span class="section-number-3">1.3.</span> Preliminaries</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org2ff8df6" class="outline-4">
<h4 id="org2ff8df6"><span class="section-number-4">1.3.1.</span> Latex Installing</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
<a href="https://en.wikipedia.org/wiki/LaTeX">LaTex</a> is a type setting program. It is widely used in the mathematical and computing communities for its ability to produce precisely and correctly typeset mathematical notation. But it has grown well beyond those roots. We will use it as the method to go from a plain .tex file to a .pdf file. 
</p>

<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/465412148?h=edf6c82157" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/465412148">Kc : LaTeX tools for report generation (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>Getting the latex packages you will need from Ubuntu for these exercises. What is LaTeX?</p>


<p>
Our emacs editor will be able to export our org file into a tex file. To go the rest of the way to a pdf we will need various libraries and packages available through our Linux installation.  Since these will be used by emacs, but not part of emacs, we will use the system package manager to get and install them. It is quite possible to use latex and all the related tools from the command line and it can often be helpful to do so. It is also possible to use these libraries from other editors. Thus we will install them with <code>apt</code>, a package manager for *buntus.
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo apt install texlive-latex-recommended
sudo apt install texlive-latex-extra
</pre>
</div>

<p>
There is also a "full" package as well that you can install instead of the above. 
</p>

<p>
LaTeX could be a whole lecture (maybe even a course) in itself. We will not go into that here, but we will just use it behind the scenes. If you are interested though there are some nice tutorials. 
</p>
</div>
</div>
