chapters/report-writing.org
*** LaTeX Tutorials for Beginners
    - [[http://ctan.mirror.rafal.ca/info/lshort/english/lshort.pdf][The not so short introduction (pdf)]]
    - [[https://en.wikibooks.org/wiki/LaTeX/Basics][Not as good but really short]]
    - [[http://tug.ctan.org/info/latex4wp/latex4wp.pdf][LaTeX for Word Processor Users (pdf)]]
    - [[https://web.archive.org/web/20201003223727/https://medium.com/@marko_kovic/why-i-write-with-latex-and-why-you-should-too-ba6a764fadf9][A polemic for writing in latex]]
      You can do this in emacs too. Look for information on the [[https://www.gnu.org/software/auctex/][Auctex.]]

*** Pdf Viewers
There are many pdf viewers that work well in the linux world. A very minimal version is
~xpdf~ whereas a much more full feature viewer is ~okular~. However, we are working in emacs and it will be convenient to install a pdf-viewer that works in that environment. Emacs comes with a "doc-view" that will render a pdf, but it is not a very pretty view and our ability to interact and edit the pdf is limited. We will use a much more full featured and modern pdf tool called =pdf-tools=. 
   
The [[https://github.com/vedang/pdf-tools][Github Repo for PdfTools]] provides extensive documentation on use and installation. I have copied the minimal version here to get us going. Note that the pdf-tools instructions describes a package manager called =aptitude=. You can use =apt= instead (https://www.tecmint.com/difference-between-apt-and-aptitude/).

It is common for the Ubuntu packages to come in both regular and development versions. As a rule of thumb if you are unsure which to install always pick the development packages (noted by the -dev at the end). This will include some extra files and details, but you will often need those extra files when trying to "make" or assemble code yourself. 

#+begin_export html
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/465411974?h=a235eb099e" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/465411974">Kd : PdfTools (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>How to view and annotate pdfs in Emacs. The PdfTools package installed.</p>
#+end_export

*** Preparing Xubuntu
    You may already have many of the files you will need to build the =pdf-tools= package, but just in case make sure to install: 
    1. gcc
    2. g++
    3. make
    4. automake
    5. autoconf
    6. libpng-dev
    7. zlib1g-dev
    8. libpoppler-glib-dev
    9. libpoppler-private-dev
    10. imagemagick
*** Preparing Emacs
    Run =M-x package-list-packages= to refresh and display available packages. Search for =let-alist= and =tablist=. Mark them both with an =i= and then type =x= to /execute/ the installation. 

    Then search for =pdf-tools= make it with an =i= and then enter =x=. This will download the pdf-tools package files to the correct directory (usually =~/.emacs.d/elpa/pdf-tools=). 
*** Building Pdf-Tools
Edit your =init.el= file and add the line 

#+BEGIN_SRC elisp :eval never
(pdf-tools-install)
#+END_SRC

The easiest way to trigger the build will be to save everything. Exit emacs. And then restart emacs. 

On your first restart you will be asked whether to rebuild an /epdf/ program. Say yes. Pdf-Tools will then figure out that you are on a -buntu and will ask for your super user password so that it can download from the Ubuntu package system any further packages or software it requires. At the end of that process you will see a message telling you if the compiliation completed successfully. If so, you can open a pdf in emacs just like any other file, =C-x C-f=. 

Test it out with a pdf. If you don't have one handy just down load one via scholar.google.com to your desktop and then open the file from within Emacs. 
    
** Writing a simple report
   1. Start Emacs
   2. We will use R.
      In the future you might prefer to use the [[https://github.com/yihui/knitr][knitr]] package and [[https://github.com/rstudio/rmarkdown][rmarkdown package]], but here we will use [[https://orgmode.org/worg/org-contrib/babel/][org-babel]] . 
   3. Testing
      - If you have emacs correctly installed and a working latex installation than you should be able to open ~testLatex.org~ (look in =codeExamples/reportGen/=) in emacs and type ~C-c C-e l p~ and you will see a new pdf file in your current directory. You can open up the pdf and view it in Emacs with the =C-x C-f=.
      - If you have R and ESS installed properly you can open up ~testRBabel.org~ from the same source diretory, and run the same command. Now the new pdf will have have code and a figure. Look at the code in the .org file. You know how to write that already. You now know how to generate a basic reproducible report.

#+begin_export html
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/465411965?h=8f1bf07c01" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/465411965">Ke : Report Generation Demo 1: Basics (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>The basics of report generation in emacs, org, and babel. The compilation steps and stages for going through LaTeX to a pdf.</p>
#+end_export
   
** Writing a not-so-simple report
*** Testing the inclusion of source code
    Go back to the file you wrote in Rmd and which has the for-loop. Now convert that file to an org file (just do a save as: =C-x C-w= substituting .org for .rmd). Edit the code blocks that you wrote as R chunks to be source blocks in org mode. You have seen examples of this already, but there is a reminder [[https://orgmode.org/worg/org-contrib/babel/intro.html][here]]. Now compile it with the =C-c C-e l p= command to generate a pdf. Keep tweaking until you get it to work. 
