book/report-writing.html


<div id="outline-container-org410ecef" class="outline-4">
<h4 id="org410ecef"><span class="section-number-4">1.3.2.</span> LaTeX Tutorials for Beginners</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li><a href="http://ctan.mirror.rafal.ca/info/lshort/english/lshort.pdf">The not so short introduction (pdf)</a></li>
<li><a href="https://en.wikibooks.org/wiki/LaTeX/Basics">Not as good but really short</a></li>
<li><a href="http://tug.ctan.org/info/latex4wp/latex4wp.pdf">LaTeX for Word Processor Users (pdf)</a></li>
<li><a href="https://web.archive.org/web/20201003223727/https://medium.com/@marko_kovic/why-i-write-with-latex-and-why-you-should-too-ba6a764fadf9">A polemic for writing in latex</a>
You can do this in emacs too. Look for information on the <a href="https://www.gnu.org/software/auctex/">Auctex.</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc922f0a" class="outline-4">
<h4 id="orgc922f0a"><span class="section-number-4">1.3.3.</span> Pdf Viewers</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
There are many pdf viewers that work well in the linux world. A very minimal version is
<code>xpdf</code> whereas a much more full feature viewer is <code>okular</code>. However, we are working in emacs and it will be convenient to install a pdf-viewer that works in that environment. Emacs comes with a "doc-view" that will render a pdf, but it is not a very pretty view and our ability to interact and edit the pdf is limited. We will use a much more full featured and modern pdf tool called <code>pdf-tools</code>. 
</p>

<p>
The <a href="https://github.com/vedang/pdf-tools">Github Repo for PdfTools</a> provides extensive documentation on use and installation. I have copied the minimal version here to get us going. Note that the pdf-tools instructions describes a package manager called <code>aptitude</code>. You can use <code>apt</code> instead (<a href="https://www.tecmint.com/difference-between-apt-and-aptitude/">https://www.tecmint.com/difference-between-apt-and-aptitude/</a>).
</p>

<p>
It is common for the Ubuntu packages to come in both regular and development versions. As a rule of thumb if you are unsure which to install always pick the development packages (noted by the -dev at the end). This will include some extra files and details, but you will often need those extra files when trying to "make" or assemble code yourself. 
</p>

<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/465411974?h=a235eb099e" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/465411974">Kd : PdfTools (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>How to view and annotate pdfs in Emacs. The PdfTools package installed.</p>
</div>
</div>

<div id="outline-container-org9360cae" class="outline-4">
<h4 id="org9360cae"><span class="section-number-4">1.3.4.</span> Preparing Xubuntu</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
You may already have many of the files you will need to build the <code>pdf-tools</code> package, but just in case make sure to install: 
</p>
<ol class="org-ol">
<li>gcc</li>
<li>g++</li>
<li>make</li>
<li>automake</li>
<li>autoconf</li>
<li>libpng-dev</li>
<li>zlib1g-dev</li>
<li>libpoppler-glib-dev</li>
<li>libpoppler-private-dev</li>
<li>imagemagick</li>
</ol>
</div>
</div>
<div id="outline-container-orgba20488" class="outline-4">
<h4 id="orgba20488"><span class="section-number-4">1.3.5.</span> Preparing Emacs</h4>
<div class="outline-text-4" id="text-1-3-5">
<p>
Run <code>M-x package-list-packages</code> to refresh and display available packages. Search for <code>let-alist</code> and <code>tablist</code>. Mark them both with an <code>i</code> and then type <code>x</code> to <i>execute</i> the installation. 
</p>

<p>
Then search for <code>pdf-tools</code> make it with an <code>i</code> and then enter <code>x</code>. This will download the pdf-tools package files to the correct directory (usually <code>~/.emacs.d/elpa/pdf-tools</code>). 
</p>
</div>
</div>
<div id="outline-container-orga9625eb" class="outline-4">
<h4 id="orga9625eb"><span class="section-number-4">1.3.6.</span> Building Pdf-Tools</h4>
<div class="outline-text-4" id="text-1-3-6">
<p>
Edit your <code>init.el</code> file and add the line 
</p>

<div class="org-src-container">
<pre class="src src-elisp">(pdf-tools-install)
</pre>
</div>

<p>
The easiest way to trigger the build will be to save everything. Exit emacs. And then restart emacs. 
</p>

<p>
On your first restart you will be asked whether to rebuild an <i>epdf</i> program. Say yes. Pdf-Tools will then figure out that you are on a -buntu and will ask for your super user password so that it can download from the Ubuntu package system any further packages or software it requires. At the end of that process you will see a message telling you if the compiliation completed successfully. If so, you can open a pdf in emacs just like any other file, <code>C-x C-f</code>. 
</p>

<p>
Test it out with a pdf. If you don't have one handy just down load one via scholar.google.com to your desktop and then open the file from within Emacs. 
</p>
</div>
</div>
</div>

<div id="outline-container-org5561e4c" class="outline-3">
<h3 id="org5561e4c"><span class="section-number-3">1.4.</span> Writing a simple report</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>Start Emacs</li>
<li>We will use R.
In the future you might prefer to use the <a href="https://github.com/yihui/knitr">knitr</a> package and <a href="https://github.com/rstudio/rmarkdown">rmarkdown package</a>, but here we will use <a href="https://orgmode.org/worg/org-contrib/babel/">org-babel</a> .</li>
<li>Testing
<ul class="org-ul">
<li>If you have emacs correctly installed and a working latex installation than you should be able to open <code>testLatex.org</code> (look in <code>codeExamples/reportGen/</code>) in emacs and type <code>C-c C-e l p</code> and you will see a new pdf file in your current directory. You can open up the pdf and view it in Emacs with the <code>C-x C-f</code>.</li>
<li>If you have R and ESS installed properly you can open up <code>testRBabel.org</code> from the same source diretory, and run the same command. Now the new pdf will have have code and a figure. Look at the code in the .org file. You know how to write that already. You now know how to generate a basic reproducible report.</li>
</ul></li>
</ol>

<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/465411965?h=8f1bf07c01" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/465411965">Ke : Report Generation Demo 1: Basics (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>The basics of report generation in emacs, org, and babel. The compilation steps and stages for going through LaTeX to a pdf.</p>
</div>
</div>

<div id="outline-container-org2552348" class="outline-3">
<h3 id="org2552348"><span class="section-number-3">1.5.</span> Writing a not-so-simple report</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org4c430ec" class="outline-4">
<h4 id="org4c430ec"><span class="section-number-4">1.5.1.</span> Testing the inclusion of source code</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
Go back to the file you wrote in Rmd and which has the for-loop. Now convert that file to an org file (just do a save as: <code>C-x C-w</code> substituting .org for .rmd). Edit the code blocks that you wrote as R chunks to be source blocks in org mode. You have seen examples of this already, but there is a reminder <a href="https://orgmode.org/worg/org-contrib/babel/intro.html">here</a>. Now compile it with the <code>C-c C-e l p</code> command to generate a pdf. Keep tweaking until you get it to work. 
</p>
</div>
</div>
