chapters/report-writing.org
*** Tables. 

Pretty much happens automatically. You may have to play with the /header/ [[https://orgmode.org/manual/Header-arguments.html#Header-arguments][arguments]] to get exactly the look you want. The /header/ arguments are those things appearing on the ~+#Begin_Src~ line. 

#+begin_src R :session *tableTest* :results output :colnames yes :exports both
  d <- data.frame(foo=c('a','b','c'), bar=c(1.0/3.0,22,32))
  d
#+end_src

#+RESULTS:
:   foo        bar
: 1   a  0.3333333
: 2   b 22.0000000
: 3   c 32.0000000

#+begin_export html
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/465411872?h=a5a8896b5a" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/465411872">Kf : Demo 2: Code and Tables (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>Continuing our demonstration of report generation we now show how to include inline code, tables, and figures.</p>
#+end_export

Try adding this to your prior file just to make sure you can get the table to execute. 
*** What is an inline result?
An inline result is one that appears at the correct place in the text. 

#+Begin_src R :session *rReportWriting* :exports none :results none
xinline = rnorm(100)
#+End_src 

Imagine that you are doing an analysis for a report and instead of having to cut and paste from some other statistical program you can just magically have the result appear in the right location in the text! Try it. Here is an example to adapt into your current file. Try it with a different number of values and a different type of random number (e.g. how about an [[https://stat.ethz.ch/R-manual/R-devel/library/stats/html/Exponential.html][exponential distribution]])?

The mean of src_R[:session *rReportWriting* :exports results :results raw]{length(xinline)} mean 0 normally distributed numbers is src_R[:session *rReportWriting* :exports results :results raw]{mean(xinline)}.

*** Can I include references?
    Yes. Of course you can. *And you should*.

    #+begin_export html
    <div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/465411716?h=4b8d9ad497" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/465411716">Kg : Report Demo 3: Including Citations (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>The final demo of report generation shows you how to get and use bibtex formatted references for managing citations in your report.</p>
#+end_export

**** Using bibtex (biber and biblatex)
     Biblatex is the modern version of this, but it can be a bit easier to get started with than /bibtex/. Both of them use the same basic format for saved text files to keep all the references that you may ever want to use. They allow you to easily reformat and reuse your references in multiple documents or flip from APA style to another reference style with a few characters of text. Using an alphabetical format that requires changing to a cite in numerical order? Just change the bibtex command and recompile your document. Done. 
**** Testing
     Open up the =test.bib= file in the =codeExamples/reportGen/= sub-directory. This will show you an example of a book and an article reference. Make sure that =testRBabelBib.org= and =test.bib= are in the same directory and that it is your current directory. If you have the right packages for latex installed, you should be able to ~C-c C-e l l~ to produce a file ending with .tex as an extension. Open this in emacs and enter ~C-c C-c~ . Ask for =latex=. Then repeat the =C-c C-c= for =bibtex= and twice more for =latex= and finally =pdflatex=. If all this seems repetitive it is possible to set things up in your =init.el` file to avoid this repetition, but this is already a pretty heavy lesson. Now look at the pdf file in emacs. You have a correctly edited, cited, and hyper linked pdf file. Amazing?


* Assessment: Report Generation with Org Babel

** Purpose
  Gain familiarity with report generation using org and babel and the inclusion of code blocks, graphics, and reference sections

** Task
  Provide an org file and its companion bib file that has a
  1. Title
  2. Author
  3. Sections for 
     - Introduction
     - Methods
     - Results
     - Conclusions
     - References
  4. Just have the headings and some minimal text. The purpose here is to get a working skeleton of a file that you can use and adapt later on.
  5. Cut and paste from your earlier examples of Rmd and Org files using R and Python to have some analysis in the results section. Make sure it includes as a minimum:
     - one code block
     - one figure
     - one inline code reference
     - one new citation other than the ones that were used in the example. 
       There are many ways to get references in the bibtex format. Scholar Google can export that format, and so will most of the major journal web pages.

** Comments
  I will evaluate submissions by compiling from org to pdf in my version of emacs. Either I will be able to produce a pdf of your report or I won't. If I can, and it meets all the requirements above then you will get full credit. 
