book/report-writing.html
<div id="outline-container-orgd652728" class="outline-4">
<h4 id="orgd652728"><span class="section-number-4">1.5.2.</span> Tables.</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
Pretty much happens automatically. You may have to play with the <i>header</i> <a href="https://orgmode.org/manual/Header-arguments.html#Header-arguments">arguments</a> to get exactly the look you want. The <i>header</i> arguments are those things appearing on the <code>+#Begin_Src</code> line. 
</p>

<div class="org-src-container">
<pre class="src src-R">d <span style="color: #008b8b;">&lt;-</span> data.frame(foo=c(<span style="color: #8b2252;">'a'</span>,<span style="color: #8b2252;">'b'</span>,<span style="color: #8b2252;">'c'</span>), bar=c(1.0/3.0,22,32))
d
</pre>
</div>

<pre class="example">
  foo        bar
1   a  0.3333333
2   b 22.0000000
3   c 32.0000000
</pre>


<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/465411872?h=a5a8896b5a" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/465411872">Kf : Demo 2: Code and Tables (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>Continuing our demonstration of report generation we now show how to include inline code, tables, and figures.</p>

<p>
Try adding this to your prior file just to make sure you can get the table to execute. 
</p>
</div>
</div>
<div id="outline-container-orgd839dde" class="outline-4">
<h4 id="orgd839dde"><span class="section-number-4">1.5.3.</span> What is an inline result?</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
An inline result is one that appears at the correct place in the text. 
</p>

<p>
Imagine that you are doing an analysis for a report and instead of having to cut and paste from some other statistical program you can just magically have the result appear in the right location in the text! Try it. Here is an example to adapt into your current file. Try it with a different number of values and a different type of random number (e.g. how about an <a href="https://stat.ethz.ch/R-manual/R-devel/library/stats/html/Exponential.html">exponential distribution</a>)?
</p>

<p>
The mean of 100 mean 0 normally distributed numbers is 0.0498254924850924.
</p>
</div>
</div>

<div id="outline-container-orgb2f80b6" class="outline-4">
<h4 id="orgb2f80b6"><span class="section-number-4">1.5.4.</span> Can I include references?</h4>
<div class="outline-text-4" id="text-1-5-4">
<p>
Yes. Of course you can. <b>And you should</b>.
</p>

    <div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/465411716?h=4b8d9ad497" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/465411716">Kg : Report Demo 3: Including Citations (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>The final demo of report generation shows you how to get and use bibtex formatted references for managing citations in your report.</p>
</div>

<ol class="org-ol">
<li><a id="orgd68eb7f"></a>Using bibtex (biber and biblatex)<br />
<div class="outline-text-5" id="text-1-5-4-1">
<p>
Biblatex is the modern version of this, but it can be a bit easier to get started with than <i>bibtex</i>. Both of them use the same basic format for saved text files to keep all the references that you may ever want to use. They allow you to easily reformat and reuse your references in multiple documents or flip from APA style to another reference style with a few characters of text. Using an alphabetical format that requires changing to a cite in numerical order? Just change the bibtex command and recompile your document. Done. 
</p>
</div>
</li>
<li><a id="orgc0b9004"></a>Testing<br />
<div class="outline-text-5" id="text-1-5-4-2">
<p>
Open up the <code>test.bib</code> file in the <code>codeExamples/reportGen/</code> sub-directory. This will show you an example of a book and an article reference. Make sure that <code>testRBabelBib.org</code> and <code>test.bib</code> are in the same directory and that it is your current directory. If you have the right packages for latex installed, you should be able to <code>C-c C-e l l</code> to produce a file ending with .tex as an extension. Open this in emacs and enter <code>C-c C-c</code> . Ask for <code>latex</code>. Then repeat the <code>C-c C-c</code> for <code>bibtex</code> and twice more for <code>latex</code> and finally <code>pdflatex</code>. If all this seems repetitive it is possible to set things up in your =init.el` file to avoid this repetition, but this is already a pretty heavy lesson. Now look at the pdf file in emacs. You have a correctly edited, cited, and hyper linked pdf file. Amazing?
</p>
</div>
</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org41e4699" class="outline-2">
<h2 id="org41e4699"><span class="section-number-2">2.</span> Assessment: Report Generation with Org Babel</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org08f7625" class="outline-3">
<h3 id="org08f7625"><span class="section-number-3">2.1.</span> Purpose</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Gain familiarity with report generation using org and babel and the inclusion of code blocks, graphics, and reference sections
</p>
</div>
</div>

<div id="outline-container-orgc837c39" class="outline-3">
<h3 id="orgc837c39"><span class="section-number-3">2.2.</span> Task</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Provide an org file and its companion bib file that has a
</p>
<ol class="org-ol">
<li>Title</li>
<li>Author</li>
<li>Sections for 
<ul class="org-ul">
<li>Introduction</li>
<li>Methods</li>
<li>Results</li>
<li>Conclusions</li>
<li>References</li>
</ul></li>
<li>Just have the headings and some minimal text. The purpose here is to get a working skeleton of a file that you can use and adapt later on.</li>
<li>Cut and paste from your earlier examples of Rmd and Org files using R and Python to have some analysis in the results section. Make sure it includes as a minimum:
<ul class="org-ul">
<li>one code block</li>
<li>one figure</li>
<li>one inline code reference</li>
<li>one new citation other than the ones that were used in the example. 
There are many ways to get references in the bibtex format. Scholar Google can export that format, and so will most of the major journal web pages.</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org0a197e4" class="outline-3">
<h3 id="org0a197e4"><span class="section-number-3">2.3.</span> Comments</h3>
<div class="outline-text-3" id="text-2-3">
<p>
I will evaluate submissions by compiling from org to pdf in my version of emacs. Either I will be able to produce a pdf of your report or I won't. If I can, and it meets all the requirements above then you will get full credit. 
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-02-13 Mon 00:00</p>
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2023-05-29 Mon 11:07</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>